Documents/Премия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Премия</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратПродукции</xr:Item>
				<xr:Item>Document.ВозвратТовараОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратТовараПоставщику</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Замена</xr:Item>
				<xr:Item>Document.Лид</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыработкаИсполнителейРозницы</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаИсполнителейПроизводства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Премии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДокументу</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.Лид</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Премия/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.Премия";
    КомандаПечати.Идентификатор = "Премия";
    КомандаПечати.Представление = НСтр("ru = 'Распоряжение о поощрении сотрудников'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Премия") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"Премия", 
			НСтр("ru = 'Распоряжение о поощрении сотрудников'"), 
			ПечатьРаспоряжения(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Премия.Ссылка КАК Ссылка,
	|	Премия.Номер КАК Номер,
	|	Премия.Дата КАК ДатаДокумента,
	|	""01.01.2001"" КАК Дата,
	|	Премия.Организация КАК Организация,
	|	Премия.Организация.ПолноеНаименование КАК НазваниеОрганизации,
	|	Премия.Подразделение КАК Подразделение,
	|	Премия.Комментарий КАК Комментарий,
	|	ПРЕДСТАВЛЕНИЕ(Премия.Основание) КАК ДокументОснование
	|ИЗ
	|	Документ.Премия КАК Премия
	|ГДЕ
	|	Премия.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Премия.Ссылка,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПремий.Ссылка КАК Ссылка,
	|	ТаблицаПремий.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПремий.Сотрудник КАК Сотрудник,
	|	ТаблицаПремий.Сотрудник.Должность КАК СотрудникДолжность,
	|	ТаблицаПремий.ВидНачисления КАК ВидНачисления,
	|	ТаблицаПремий.Сумма КАК Сумма,
	|	ТаблицаПремий.Валюта КАК Валюта,
	|	ТаблицаПремий.КДокументу КАК КДокументу
	|ИЗ
	|	Документ.Премия.Премии КАК ТаблицаПремий
	|ГДЕ
	|	ТаблицаПремий.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаПремий.Ссылка,
	|	ТаблицаПремий.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиПремии = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиПремии",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиПремии);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента,"ДЛФ=Д");
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер); 
		Исключение
		КонецПопытки;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьРаспоряжения(МассивОбъектов, ОбъектыПечати) Экспорт
	
 	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_РаспоряжениеОПоощрении";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Премия.ПФ_MXL_Т11а");
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоПремиям = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиПремии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);
    
    ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;		
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоПремиям.Сбросить();
		Если ВыборкаПоПремиям.НайтиСледующий(СтруктураПоиска) Тогда
			Выборка = ВыборкаПоПремиям.Выбрать();			
			Пока Выборка.Следующий() Цикл			
				Попытка
					ОбластьМакета = Макет.ПолучитьОбласть("Строка");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				Исключение
				КонецПопытки;		
			КонецЦикла;
		КонецЕсли;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.Руководитель = ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Организация.Руководитель.Наименование);
				ОбластьМакета.Параметры.ДолжностьРуководителя = ДанныеПечати.Организация.Руководитель.Должность;
			Исключение			
			КонецПопытки; 		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Добавляет команду создания документа "Премия".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании, Порядок = 0) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.Премия) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.Премия.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.Премия.Представление();
		//КомандаСоздатьНаОсновании.РежимЗаписи = "Запись";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Порядок = Порядок;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли
